import { Context, Schema, Random, h } from "koishi";

export const name = "xianling-bot-help";

import { } from "@koishijs/canvas";

export interface Config { }

export const Config: Schema<Config> = Schema.object({});

let randoms = new Random(() => Math.random());

export async function apply(ctx: Context) {



    ctx.command('仙灵')
        .subcommand('我要修仙')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒欢迎道友加入仙灵世界⇐\n═══════════════\n  首次使用请选择：\n           ⇨【修仙帮助】⇦\n          ⇨【道侣姻缘】⇦\n          ⇨【技能转职】⇦\n          ⇨【家园建设】⇦\n          ⇨【市场经营】⇦\n          ⇨【剧情模拟】⇦\n          ⇨【仙榜排行】⇦\n          ⇨【福利社区】⇦\n          ⇨【修仙图鉴】⇦\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n 查看图片请发送 ⇒【仙灵帮助图片】`
        })

        ctx.command('仙灵')
        .subcommand('修仙帮助')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒好的仙灵利于度过前期⇐\n═══════════════\n  首次使用请发送：\n     ⇒【修仙信息】\n             『觉醒天赋』        \n  【我的仙灵】     【重聚仙灵】\n             『散财避劫』        \n  【灵石修炼】    【送灵石】\n             『问道长生』        \n  【闭关修炼】     【出关问世】\n  【道场闭关】     【道场出关】\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n 查看图片请发送 ⇒【修炼帮助图片】\n`
        })
        ctx.command('仙灵')
        .subcommand('道侣姻缘')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒开发团队祝福每段姻缘⇐\n═══════════════\n  首次使用请发送：\n     ⇒【我的道侣】\n             『相知相识』        \n   【结缘】       【缘尽】\n             『倾城之恋』        \n  【情缘赠送】    【情缘使用】\n             『红豆南国』        \n  【道侣双修】\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n 查看图片请发送 ⇒【道侣帮助图片】\n`
        })
        ctx.command('仙灵')
        .subcommand('技能转职')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒战力系统看上去真不错⇐\n═══════════════\n  首次使用请发送：\n     ⇒【职业介绍】\n             『转职设定』        \n  【职业转职】     【职业介绍】\n             『功法学习』        \n  【暂未开发】    【暂未开发】\n             『神通学习』        \n  【暂未开发】    【暂未开发】\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n 查看图片请发送 ⇒【职业帮助图片】\n`
        })
        ctx.command('仙灵')
        .subcommand('职业介绍')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒失败找九川他制作概率⇐\n═══════════════\n  首次使用请发送：\n     ⇒【职业介绍】\n             『铸纹师』        \n ⇨感悟天地，铸造珍稀物品。\n状态：已解锁\n             『仙 门』        \n ⇨出来混，看有没有背景。\n状态：未开放\n             『御兽师』        \n ⇨有钱人的游戏。\n状态：未开放\n             『炼器师』        \n ⇨幸运值加点的大富翁。\n状态：未开放\n             『阵法师』        \n ⇨护一方平安\n状态：未开放\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n 查看图片请发送 ⇒【职业帮助图片】\n`
        })
        ctx.command('仙灵')
        .subcommand('家园建设')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒道场建筑评分取决生态⇐\n═══════════════\n  首次使用请发送：\n     ⇒【我的道场】\n             『家园初建』        \n  【开拓道场】     【建设道场】\n             『家园经营』        \n  【暂未开发】    【暂未开发】\n  【暂未开发】    【暂未开发】\n  【暂未开发】    【暂未开发】\n             『道场收获』        \n  【收获道场】     【背包】\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n 查看图片请发送 ⇒【道场帮助图片】\n`
        })
        ctx.command('仙灵')
        .subcommand('市场经营')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒听说Ffmpeg是个男娘⇐\n═══════════════\n  很抱歉，市场模式仅限内测上线\n  暂不在内测期间开放。`
        })
        ctx.command('仙灵')
        .subcommand('剧情模拟')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒听说开发者SMM萝莉控⇐\n═══════════════\n ⇒发送【剧本姬】查看更详细指令。`
        })
        ctx.command('仙灵')
        .subcommand('仙榜排行')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒界碑无上才可以争夺⇐\n═══════════════\n  首次使用请阅读：\n 拒绝恶意竞争，友谊第一。\n             『境界排行』        \n             『三生石』        \n              『界碑』        \n             『铸纹排行』        \n             『暂未开发』        \n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n  ⇒作者加急更新中.....`
        })
        ctx.command('仙灵')
        .subcommand('福利社区')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒注册会发放新手礼包⇐\n═══════════════\n  首次使用请发送：\n     ⇒【新手礼包】\n             『每日签到』        \n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n  ⇒作者加急更新中.....`
        })
        
    ctx.command('仙灵')
        .subcommand('修仙图鉴')
        .action(() => {
            return ` ‎\n═══════════════\n     ⇒修仙图鉴支持玩家投稿⇐\n═══════════════\n             『快捷查看』\n             ⇨【界碑】⇦\n          ⇨【情缘礼物】⇦\n          ⇨【仙灵品阶】⇦\n          ⇨【境界列表】⇦\n          ⇨【境界灵力】⇦\n          ⇨【正在制作】⇦\n          ⇨【暂未开发】⇦\n          ⇨【暂未开发】⇦\n          ⇨【暂未开发】⇦\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n  ⇒作者加急更新中.....`
        })
        ctx.command('仙灵')
        .subcommand('界碑')
        .action(() => {
            return ` ‎\n┏━✪༺界ۣۖ༒碑ۣۖ༻✪━━\n┣ 星链 尊名 境界 归凡\n┣ -----|=========·-----\n┣ 天枢   荒   极道 九转\n┣ || 称号：荒天帝\n┣ || 道场：荒的神域\n┣ || 神录：吾以荒名，号令诸天。\n                 若有因果，尽加吾身。\n┣ -----|=========·-----\n┣ 天璇 羡慕 无上 九转\n┣ || 称号：命运\n┣ || 道场：羡慕的宝地\n┣ || 神录：命运如书难预测\n┣ -----|=========·-----\n┣ 天玑 叶凡 无上 九转\n┣ || 称号：叶天帝\n┣ || 道场：叶凡的宝地\n┣ || 神录：我为天帝，当镇压世间\n                 一切敌。\n┣ -----|=========·-----\n┣ 天权 诗雨秋叶 无上 九转\n┣ || 称号：诗雨圣女\n┣ || 道场：诗雨秋叶的仙境\n┣ || 神录：天地为笔，书仙之诗\n┣ -----|=========·-----\n┣ 玉衡 张若尘 无上 六转\n┣ || 称号：万古神帝\n┣ || 道场：张若尘的仙境\n┣ || 神录：身无彩凤双飞翼\n                 心有灵希一点通。\n‎\n┗界碑仅记录前七|隔24小时刷新`
        })
        ctx.command('仙灵')
          .subcommand('情缘礼物')
          .action(() => {
            return `‎\n群公告有，等我哪天起的早再写。\n﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎\n  ⇒作者加急更新中.....`
        })
        ctx.command('仙灵')
        .subcommand('仙灵品阶')
        .action(() => {
            return ` ‎\n══仙灵品阶══\n评级  获取  概率\n无上  隐藏  0.1%\n道品  抽取  1%\n源极  抽取  1%\n源品  抽取  2%\n根极  抽取  5%\n根品  抽取  5%\n众极  抽取  10%\n众品  抽取  25%\n凡品  抽取  50%`
        })
        ctx.command('仙灵')
        .subcommand('境界灵力')
        .action(() => {
            return ` ‎\n境界所需灵力：\n 人境：0\n 凡境悟法：2500\n 凡境凝纹：5000\n 凡境铸纹：1.00万\n 灵境：5.00万\n 灵境蕴灵：10.00万\n 灵境通灵：20.00万\n 灵境妙法：40.00万\n 半步地境：100.00万\n 地境铸则：200.00万\n 地境悟道：400.00万\n 地境通天：800.00万\n 半步天境：1000.00万\n 天境归凡：1.00亿\n 尊者境：10.00亿\n 尊者寂灵：20.00亿\n 尊境破虚：40.00亿\n 尊境合道：80.00亿\n 尊境化神：100.00亿\n 大帝：200.00亿\n 天帝：400.00亿\n 圣帝：1000.00亿\n 入圣境：2000.00亿\n 圣境（散魄）:4000.00亿\n 圣境（斩魂）:8000.00亿\n 圣境（弑情）:1.60万亿\n 圣境（归一）:3.20万亿\n 神境：10.00万亿\n 神境一阶：20.00万亿\n 神境二阶：40.00万亿\n 神境三阶：80.00万亿\n 神境四阶：160.00万亿\n 神境五阶：320.00万亿\n 神境六阶：640.00万亿\n 神境七阶：1000.00万亿\n 神境八阶：2000.00万亿\n 神境九阶：4000.00万亿\n 无上：1兆亿`
        })
    //修仙快捷图鉴


        ctx.command('仙灵')
        .subcommand('仙灵帮助图片')
        .action(() => {
            return h.image('https://i0.hdslb.com/bfs/article/14e2a6bfc91c3da21b794ec99e8cc28f486188624.png')
        })
        ctx.command('仙灵')
        .subcommand('修仙帮助图片')
        .action(() => {
            return h.image('https://i0.hdslb.com/bfs/article/6375e6b2694e53f5b5d9bc0793c8d791486188624.png')
        })
    ctx.command('仙灵')
        .subcommand('修炼帮助图片')
        .action(() => {
            return h.image('https://i0.hdslb.com/bfs/article/118fc24143a84ba816ab44a9c30bc1f8486188624.png')
        })
    ctx.command('仙灵')
        .subcommand('道侣帮助图片')
        .action(() => {
            return h.image('https://i0.hdslb.com/bfs/article/f9f85c3d97b4e71aed961969706cf89a486188624.png')
        })
    ctx.command('仙灵')
        .subcommand('道场帮助图片')
        .action(() => {
            return h.image('https://i0.hdslb.com/bfs/article/afc61913856c61ce61b6c5862b6ae8b8486188624.png')
        })
    ctx.command('仙灵')
        .subcommand('职业帮助图片')
        .action(() => {
            return h.image('https://i0.hdslb.com/bfs/article/c12f7d80c238699a3d703790131574ef486188624.png')
        })
    //新人帮助的图片。
    
    
    
    
    
        ctx.command('仙灵')
        .subcommand('铸纹帮助')
        .action(() => {
            return `
铸纹面板
/铸纹师专属职业信息面板
晋级
/提升铸纹等级，刻不容缓
铸纹 金 数量 木 数量 水 数量 火 数量 土 数量
/铸纹消耗大量灵蕴
铸纹师排名
/查看自己的铸纹排名`
        })
}
